Revit 2024 API
ProjectLocationSetIterator Class
An iterator to a project location set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class ProjectLocationSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class ProjectLocationSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class ProjectLocationSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ProjectLocationSetIterator
See Also
ProjectLocationSetIterator Members
Autodesk.Revit.DB Namespace